### Import Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Load the Data

In [2]:
df=sns.load_dataset('titanic')

In [3]:
df.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Initial Data Exploration

In [4]:
df.shape

(891, 15)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

### Unique Identifiers

In [6]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

### Statistical Summary

In [7]:
# For Numerical columns
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
# For categorical
df.select_dtypes(include=['object', 'category']).columns

Index(['sex', 'embarked', 'class', 'who', 'deck', 'embark_town', 'alive'], dtype='object')

### Categorical Analysis

In [9]:
# Frequency Count
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [10]:
df['embarked'].value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [11]:
df['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [12]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [13]:
df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [14]:
df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [15]:
df['alive'].value_counts()

alive
no     549
yes    342
Name: count, dtype: int64

### Handling Missing Values

In [17]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### Imputation Missing Values

### Mean Value Imputation

In [19]:
df['age_mean'] = df['age'].fillna(df['age'].mean())

In [20]:
df[['age_mean', 'age']]

      age_mean   age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

### Median Imputation

In [21]:
df['age_median'] = df['age'].fillna(df['age'].median())

In [23]:
df[['age_median', 'age_mean', 'age']]

     age_median   age_mean   age
0          22.0  22.000000  22.0
1          38.0  38.000000  38.0
2          26.0  26.000000  26.0
3          35.0  35.000000  35.0
4          35.0  35.000000  35.0
..          ...        ...   ...
886        27.0  27.000000  27.0
887        19.0  19.000000  19.0
888        28.0  29.699118   NaN
889        26.0  26.000000  26.0
890        32.0  32.000000  32.0

[891 rows x 3 columns]

### Mode Imputation - Categorical Values

In [41]:
#Calculate mode 
mode_value = df['embarked'].mode()[0]

In [42]:
df['embarked_mode'] = df['embarked'].fillna(mode_value)

In [50]:
filled_rows = df[df['embarked'].isna()][['embarked', 'embarked_mode']]

In [51]:
filled_rows

    embarked embarked_mode
61       NaN             S
829      NaN             S

In [45]:
df['embark_town_mode'] = df['embark_town'].fillna(df['embark_town'].mode()[0])

In [52]:
filled_rows_embark_town = df[df['embark_town'].isna()][['embark_town', 'embark_town_mode']]

In [53]:
filled_rows_embark_town

    embark_town embark_town_mode
61          NaN      Southampton
829         NaN      Southampton

In [48]:
df['deck_mode'] = df['deck'].fillna(df['deck'].mode()[0])

In [56]:
filled_rows_deck = df[df['deck'].isna()][['deck', 'deck_mode']]

In [57]:
filled_rows_deck

    deck deck_mode
0    NaN         C
2    NaN         C
4    NaN         C
5    NaN         C
7    NaN         C
..   ...       ...
884  NaN         C
885  NaN         C
886  NaN         C
888  NaN         C
890  NaN         C

[688 rows x 2 columns]